3900-sample2-MT.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>CEG 3900: Sample Exam</title>
<!-- 2017-03-13 Mon 05:28 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Prabhaker Mateti" />
<meta  name="description" content="Mateti: Android Internals and Security"
 />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../"> UP </a>
 |
 <a accesskey="H" href="../../Top/index.html"> HOME </a>
</div><div id="preamble" class="status">
<a href="../../"> ../../</a>
</div>
<div id="content">
<h1 class="title">CEG 3900: Sample Exam</h1>
<p>
80 minutes 100 points Weight 20%
</p>

<p>
Use your laptop or a PC while answering.  You are welcome to use
IdeaJ, and Android Studio + SDK tools, but <b>not</b> websites.  Apart from
these, this is a closed book, closed notes exam.  Do not give or take
help during the exam.  In particular, you are honor bound not to
Internet surf or access any content already existing (other than as
indicated) once you access the exam until you turnin the
<code>mt-answers.pdf</code> and other files.  Please leave wide margins.
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Part I</h2>
<div class="outline-text-2" id="text-1">
<p>
(5 points each) The following statements may or may not be (fully or
  partially) valid.  First, explain the <span class="underline">underlined</span>
  technical term(s).  Then, explain/ discuss/ dispute the
  statement.  It is possible to write, say, five, sentences each,
  and yet receive full score.
</p>

<ol class="org-ol">
<li>An <span class="underline">Android Activity</span> always runs in the background.
</li>

<li>Even though <span class="underline">Android SDK</span> is "complete", there is no
command line program that lets you install, un-install, push
and pull files on the virtual device &#x2013; you have to go to the
GUI of the virtual device.
</li>

<li>Every Android app must connect with a cloud <span class="underline">service</span>.
</li>

<li>A <span class="underline">client</span> runs on the Android device, and a <span class="underline">server</span> runs on the
PC.
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Part II</h2>
<div class="outline-text-2" id="text-2">
<p>
(40 points) Develop the following APK using Android Studio.  It is
being done in the "exam environment", and many imperfections will be
forgiven.
</p>

<ol class="org-ol">
<li>Here is a link to the code of <a href="../Lectures/Java8/src/Meenie.java">Eeny Meeny Miny Moe</a>
threads that we discussed in the lectures.  Turn this into a proper
Android APK, with mods as follows.  There are several numbers in
the main method: 500, 100, 200, 300, 5000.  In the app, they should
be in the "settings".  Replace the System.out.println() with four
rectangular areas one for each thread showing the value of int i.
Submit the APK and the source code bundle.
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Part III</h2>
<div class="outline-text-2" id="text-3">
<p>
(10 points each) Answer the following, at the level of Android
  app development details, Android internals, etc.
</p>

<ol class="org-ol">
<li>Here is a link to <a href="./anUnknown.apk">./anUnknown.apk</a>.  What activities does it have?
How did you discover? What is the best way to discover these?
</li>

<li>Write the equivalent of Compute, using stream, map and reduce, and
without using loops.
<div class="org-src-container">

<pre class="src src-java">List &lt;Integer&gt; a = Arrays. asList (12, 32, 45, 54, 65);
List &lt;Integer&gt; b = Arrays. asList (22, 44, 55, 66, 77);

int Compute() {
  int r = 0;
  for (int i = a.length; i &gt; 0; i--) {
    r += a[i] * b[i];
  }
  return r;
}
</pre>
</div>
</li>

<li>Give the pre-condition (assertion) of Compute above as
Java assert.
</li>

<li>Make a simple APK out of the Compute above.  Introduce the app in
the first screen.  In subsequent screens, interactively obtain the
lists for a and b.  After an OK, invoke Compute(), and show r, the
result.      Submit the APK and the source code bundle.
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Part IV</h2>
<div class="outline-text-2" id="text-4">
<ol class="org-ol">
<li>(0 points) [For survey purposes only.] Please record your effort in
minutes for each of the above items. Other feedback you wish to
give is also welcome.
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> End</h2>
<div class="outline-text-2" id="text-5">
</div>
</div>
</div>
<div id="postamble" class="status">
<hr size=1>Copyright &copy; 2017 <a href="http://www.wright.edu/~pmateti">www.wright.edu/~pmateti</a> &bull; 2017-03-08
</div>
</body>
</html>
